# Створіть масив зі строками, які будуть складатися з чисел, які розділені комою. Наприклад:
# [”1,2,3,4”, ”1,2,3,4,50” ”qwerty1,2,3”]
# Для кожного елементу списку виведіть суму всіх чисел (створіть нову функцію для цього).
# Якщо є символи, що не є числами (”qwerty1,2,3” у прикладі), вам потрібно зловити вийняток і вивести “Не можу це зробити!”
#  Використовуйте блок try\except, щоб уникнути інших символів, окрім чисел у списку.
#  Для цього прикладу правильний вивід буде - 10, 60, “Не можу це зробити”


argument = ["1,2,3,4", "1,2,3,4,50", "qwerty1,2,3"]

def sum_numbers_in_string(s: str) -> int:
    return sum(map(int, s.split(",")))

for item in argument:
    try:
        print(sum_numbers_in_string(item))
    except ValueError:
        print("Не можу це зробити!")
